[{"title": "Mental Health First Aid Training", "date_published": "May 31, 2022", "content": "\nAs a student of Codeup, going through a massive career transition can be mentally taxing. Did you know that members of our student-facing staff and human resources team are trained in Mental Health First Aid? Let’s dive into what that means for Codeup! \nMental Health First Aid Training \nSome of our Codeup staff that works directly with our students are trained in Mental Health First Aid. This includes members of our student experience team, career coaches, and the human resources department. This training was courtesy of the Center for Health Care Services in San Antonio. They graciously provided the funding and training for our team in this pilot training program. \nWhat is Mental Health First Aid? According to mentalhhealthfirstaid.org, “is a course that teaches you how to identify, understand, and respond to signs of mental illness and substance use disorders. The training gives you the skills you need to reach out and provide initial help and support to someone who may be developing a mental health or substance use problem or experiencing a crisis”.\nTo be clear, our staff are not licensed, mental health professionals. What MHFA equips our staff with are tools to gauge risk and connect students and staff with the help they might need. This might include recognizing something in a meeting, picking up on cues during a casual conversation, or acting on a pattern behavior. \nHow does this help our students?\nMany who go through Codeup’s programs will tell you it is both rewarding and challenging all at the same time. Some students have compared learning at Codeup to  “drinking from a firehouse”. You learn so much at once, so fast. This style of learning if you are not used to it can be taxing on anyone’s mental fortitude. This allows our staff who work closely with the students to be able to identify if a student is in need of mental health help. \nConsider Your Career Change Today\nWhy does this skill set matter? You! We’re here to support your career transition as best we can, and Mental Health First Aid training is just one small piece of that larger support effort. Learn more about how we can support your career transition by applying today. \n \n"}, {"title": "Inclusion at Codeup During Pride Month (and Always)", "date_published": "Jun 1, 2022", "content": "\nHappy Pride Month! Pride Month is a dedicated time to celebrate and support the LGBTQIA+ community. At Codeup, one of our core values is Cultivating Inclusive Growth, something that takes on many shapes, sizes, forms, and colors. From representation in tech to empowering and supporting all, let’s reflect on how we live out this core value for our LGBTQIA+ community, not just during Pride Month, but always.\nCultivating Inclusive Growth\nWe’re firm believers that the people making tech should look like the people using it, which is everyone. We’re proud to offer Pride Scholarships year round, which aim to increase, support, and promote representation of the LGBTQIA+ community in tech. However, representation is only one part of cultivating inclusive growth. We want to help create a thriving tech community where everyone feels represented, but also safe and empowered.\nIn a 2019 survey conducted by Blind, 83% of LGBQ technologists and 78% of trans or gender non-conforming technologists reported that they felt safe in the workplace. In 2020, those numbers dropped to 76% and 64%, respectively.\nWhy the drop? Maybe recent pushes for representation in tech weren’t followed up with efforts to truly cultivate inclusivity and growth.\nCodeup Initiatives\nTo cultivate inclusive growth, we don’t stop at representation. We also empower and support our community so that no one feels unsafe. Our internal DEI Taskforce empowers our staff with resources and conversations that aim to create a diverse culture of support, safety, and inclusivity for each other and our students.\nEquipped with this knowledge, our staff can cultivate inclusive growth from the first time they interact with an applicant all the way until they get placed into a new job. They may have even felt empowered just by seeing our students and staff sporting their Pride t-shirts around town. \nNot only do we want the people making tech to look like the people using it, we also want them to feel safe and empowered to do so.\nIf you’re looking for a career in tech, let us empower you every step of the way! First, apply now. Then, apply for our Pride Scholarship.\n"}, {"title": "Codeup Dallas Joins Career Day", "date_published": "May 16, 2022", "content": "\nLast week our Codeup Dallas team participated in Career Day at James Madison High School which also included students from Lincoln High School. This Career Day was an initiative by United Way Dallas. Toyota, Goodwill, Dallas college, and the US Army we’re all in attendance as well to support the Career Day. \nOur team directly impacted about 60 students! We held three 45 minute sessions where we talked about the following: \n\nNon-traditional career paths \nThe different careers in tech \nProvided resources for creating a solid first resume \nDiscussed what we each did at Codeup \n\nWe wrapped up each session with a fun Kahoot review and awarded some Codeup swag to the top winners! \nWe want to thank United Way Dallas for having us out to support our local Dallas community. If you would like our Coduep team to come out and talk to your students about non-traditional career paths like our career accelerator programs, email us at marketing@codeup.com. \nCheck out more photos of the event on our Instagram page.\n"}, {"title": "From Bootcamp to Bootcamp | A Military Appreciation Panel", "date_published": "Apr 27, 2022", "content": "\n\n\n\n\n\nIn honor of Military Appreciation Month, join us for a discussion with Codeup Alumni who are also Military Veterans! We will chat about their experiences attending a coding bootcamp, and how their military training set them up for success here at Codeup. Grab your virtual seat now so you can be sent the exclusive Livestream link on the 11th! \nThank you to our panelists for participating: \n\nChristopher Aguirre\nTaryn McKenzie \nDesiree McElroy \n\n\nAnd thanks to Codeup’s Trey Iapachino who is also an Air Force Veteran! \n\n\n\n\n\n\n\n\n\n\n\n \n\n"}, {"title": "5 Reasons To Attend Our New Cloud Administration Program", "date_published": "May 17, 2022", "content": "\nCome Work In The Cloud\nWhen your Monday rolls around, do you start to get a sense of dread? That might be a sign to break up with your current job and learn something new. At Codeup, we don’t want you to keep your head in the clouds while working a job you can’t stand. You should learn all about the cloud and cloud technology! As we charge forward into 2022, we recently announced our brand new Cloud Administration Program. \nThis is a 15-week career accelerator that gets you hands-on experience with:\n\nNetworking\nLinux Operating System \nWindows Operating System \nSecurity \nAmazon Web Services (AWS) Cloud Technology\n\nYou’ll earn two industry-recognized certifications as an AWS Cloud Practitioner and AWS Solutions Architect Associate. Both are included as part of your tuition. You will learn how to build infrastructure that enables software and data science products, manage cloud deployments, and optimize for cloud performance. \nHere are 5 reasons why we think you should attend our Cloud Administration program: \n \n1.) The Campus \nLocated on Rackspace property, our Castle campus has everything you need. Tabletop games to play with classmates on break? We got foosball and ping pong! Need a drink to quench your thirst? We have complimentary soda, water, and tea. \nThere is also lots of seating across the campus for you to study, have lunch, or even meet with classmates. \nParking is free since we are located on Rackspace’s property. You have the option to park about 100 ft away from our building, or you can park on the underground level to save your car from the heat if you attend during the summer months. \nThere is also plenty of food options within driving distance of campus. Fast food options include Mcdonald’s, Panda Express, and Bill Miller’s BBQ. For more sit-down restaurant options, you can visit Applebee’s, Buffalo Wild Wings, or Olive Garden. If you want to bring your lunch we have microwaves and refrigerators to enjoy your lunch on campus. \n \n2.) Time and Money Spent \nIn just 15 weeks you will be on your way to a new career that’s in high demand! That means you won’t have to wait 2 – 4 years like other traditional degree plans to get started in your new career. \nIs the cost of our program a concern? We totally understand if it is. Our Cloud Administration program is also the most affordable option of our three programs at Codeup if you’re looking to save the most money. It’s also more affordable than a traditional degree. \nAt Codeup we have a dedicated team of Financial Aid and Enrollment managers who will work with you one on one to ensure you have everything you need to pay for your time at Codeup that makes sense for your individual situation. \nWe have grants, scholarships, and student loans for those who qualify. If you’re a Veteran or a dependant of a Veteran you might have GI Bill benefits for use at Codeup. We just launched an exclusive scholarship with Climb Credit that you can apply for here. \nLastly, you can always go through your own financial institution to see what options are available to pay for Codeup. \nCheck out a walkthrough of our financial aid options here. \n \n3.) Salary & Benefits \nAlmost everyone changing careers during the “Great Resignation” is doing it for better pay and better benefits. \nWhat if I told you that any career you obtain through our Cloud Administration program offered you both a better salary and better benefits? \nAccording to Indeed.com the average salary for a Cloud Engineer right now is $118,712 in Texas (which is similar to the National average). This mirrors a Glassdoor Median Base salary of $118,999. Glassdoor also notes a job satisfaction rating of 4 out of 5 and over 10K open roles under the title Cloud Engineer. \nAre you guaranteed a salary like that after graduation? Not necessarily since this was an average salary. However, what that means is you have the potential to get to that level of salary at some point in your new career.\nYour new skill sets could land you at a larger company like Accenture, EY, or even USAA. On the other hand, you could end up at a small company like a startup or SaaS (software as a service) company. \nBoth of those options will typically give you things like a great health care plan, generous amounts of time off, and additional perks like continuing education and gym discounts. Startups might be a little more unique in their offerings like remote work options, paying for new office equipment, and even potentially paying for an annual company retreat if the company works remotely. \n \n4.) Job Security\nAccording to IT senior managers in a recent Robert Half survey, cloud expertise is the topmost in-demand skill set. This means cloud experts are in high demand and will continue to be as more companies adopt cloud infrastructures. The curriculum you go through in this program won’t stick you to just one lane. Coming out of the Cloud Administration program you could land a job as a: \n\nCloud Engineer\nCloud Network Engineer \nCloud Security Engineer \nCloud Architect \nCloud Administrator \n\nHaving this many career options to choose from makes you a valuable and in-demand candidate for any tech company big or small. At Codeup, we have an employer-influenced curriculum. So once you graduate, you are equipped with the latest skills and knowledge today’s employers are looking for. \n \n5.) Our Instructors Are Next Level \nOur instructors genuinely care about your success. They lecture and take questions in real-time. Instead of giving you the answer, they will guide you in the right direction until you understand it yourself. They are all responsive and engaging, with a commitment to your success and a mission of empowering life change. \nAt other boot camps, you won’t find the same quality of instructors with industry experience, subject matter expertise, and live interactive lectures and lab. Even at the college level, professors often don’t provide individualized attention, hands-on learning, or accountability. Our instructors make a difference in your learning journey. \nIf having awesome instructors wasn’t enough, we also have a dedicated Student Experience team. This team is designed to work in collaboration with our instructors to ensure your success. Need a one-on-one session with your instructor? They can help with that. Need help just managing your time better? They can help with that too! These are passionate education professionals who want to empower you to get to that finish line we call graduation! \nRead more about why you need the best coding Bootcamp instructors here. \n \nWrapping Up\nAs we mentioned, as more companies adopt cloud technologies the demand for cloud experts will only continue to grow. Take this as a sign to launch your career in tech and attend our brand new Cloud Administration program today. \nOur next class starts June 16th so don’t wait to get started and fill out this form here for our admissions team to get in touch with you. You can beat the heat this summer, learn new skills, and launch your career in the cloud! We can’t wait to hear from you! \n"}]